---
kind: type
id: T:Autodesk.Revit.DB.CurtainGridLine
source: html/42c94f55-1972-5f12-1dd4-db15ad1af3d3.htm
---
# Autodesk.Revit.DB.CurtainGridLine

Represents a CurtainGridLine within Autodesk Revit.

## Syntax (C#)
```csharp
public class CurtainGridLine : HostObject
```